# 1.  Створити список цілих чисел,
# які вводяться з терміналу та визначити серед них
# максимальне та мінімальне число.
# inp_lst = input("Введіть кількість елементів вашого списку: ")
# lst=[]
# for i in range(int(inp_lst)):
#     lst.append(i)
# print(lst)
# print(max(lst))
# print(min(lst))

# lst_2=[int(input("Введіть наступне число: ")) for i in range(int(input("Введіть кількість елесментів вашого списку: ")))]
# print(lst_2)
#print(max(lst_2))
# print(min(lst_2))


#2.  В інтервалі від 1 до 10 визначити числа
#•  парні, які діляться на 2,
#•  непарні, які діляться на 3,
#•  числа, які не діляться на 2 та 3.

# par=[i for i in range(1,10) if i%2==0]
# ne_par=[i for i in range(1,10) if i%2!=0 and i%3==0]
# ne_dil_2_3=[i for i in range(1,10) if i%2!=0 and i%3!=0]


#3 Написати програму, яка обчислює факторіал числа,
# яке користувач вводить.(не використовувати рекурсивного виклику функції)
# num_inp = int(input("Ведіть число: "))
# num=1
# fakt =1
# while num <= num_inp:
#     fakt*=num
#     num+=1
# print(fakt)


# 4.  Напишіть скрипт, який перевіряє логін, який вводить користувач.
# Якщо логін вірний (First), то привітайте користувача.
# Якщо ні, то виведіть повідомлення про помилку.
# (використайте цикл while)
# inp = input("Введіть логін : ")
# login ="1111"
# while inp != login:
#     print("Ви ввели невірний логін")
#     break
# else:
#     print("Welcome!")

#5.  Перший випадок.
#Написати програму, яка буде зчитувати числа поки не зустріне від’ємне число.
# При появі від’ємного числа програма зупиняється (якщо зустрічається 0 програма теж зупиняється).
# num = 1
# while num > 0:
#     num = int(input("Введіть число: "))
#     print(num)
# else:
#     print("Ви ввели відємне число або 0")


#6.  Другий випадок.
#На початку на вхід подається кількість елементів послідовності,
# а потім самі елементи. При появі від’ємного числа програма зупиняється
# (якщо зустрічається 0 програма теж зупиняється).
# lst = [1, 4, 6123, 8, 2, 62, 93, 2, -1, 23, 324, 0, 234]
# for i in lst:
#     if i > 0:
#         print(i)
#     else:
#         print("Програм зупинилась через число яке <=0")


#7.  Знайти прості числа від 10 до 30, а всі решта чисел представити у вигляді добутку чисел
# (наприклад 10 equals 2 * 5
#                     11 is a prime number
#                     12 equals 2 * 6
#                     13 is a prime number
#                     14 equals 2 * 7
#                      ………………….)
# for i in range(10,31):
#     if i % 2 == 0:
#         print("{} equals 2 * {}".format(i, int(i/2)))
#     else:
#         print("{} is a prime number".format(i))

#8.  Відсортувати слова в реченні в порядку їх довжини (використати List Comprehensions)
# a = "Відсортувати слова в реченні в порядку їх довжини"
# a_sp =a.split()
# a_sort = [a_sp.sort(key=len) for i in a_sp]
# print(a_sp)