#1.  Написати функцію, яка знаходить середнє арифметичне
# значення довільної кількості чисел
# def ser(*args):
#     return sum(args)/len(args)
# print(ser(1,2,3))


#2. Написати функцію, яка повертає абсолютне значення числа
# def func(n):
#     return abs(n)
# print(func(-5))


#3. Написати функцію, яка знаходить максимальне число з двох чисел,
# а також в функції використати рядки документації DocStrings.
# def max_num(a,b):
#     """Визначаємо максимальне число"""
#     return max(a,b)
# print(max_num(1,2))
# print(max_num.__doc__)


#4.  Написати програму, яка обчислює площу прямокутника,
# трикутника та кола (написати три функції для обчислення площі,
# і викликати їх в головній програмі в залежності від вибору користувача)
# inp = int(input("Якщо вам потрібна площа прямокутника введіть 1, трикутника 2, кола 3 :"))
# def pl_pr(a, b):
#     print("Площа прямокутника = {}".format(a*b))
# def pl_tr(a,h):
#     print("Площа трикутника: {}".format(int(0.5 * a * h)))
# def pl_ko(r, p=3):
#     print("Площа кола: {}".format(p * (r ** 2)))
# if inp == 1:
#     inp_pr_a = int(input("Введіть довжину сторони a :"))
#     inp_pr_b = int(input("Введіть довжину сторони b :"))
#     pl_pr(inp_pr_a, inp_pr_b)
# elif inp == 2:
#     inp_tr_a = int(input("Введіть довжину однієї сторони a :"))
#     inp_tr_h = int(input("Введіть довжину висоти h :"))
#     pl_tr(inp_tr_a, inp_tr_h)
# elif inp == 3:
#     inp_kola_r = int(input("Введіть довжину радіуса r :"))
#     pl_ko(inp_kola_r)
# else:
#     print("Error, Прочитайе умову ще раз!")


#5.  Написати функцію, яка обчислює суму цифр введеного числа.
# def sum_n():
#     inp = input("Введіть число: ")
#     sum=0
#     for i in inp:
#         sum+=int(i)
#     return sum
# print(sum_n())


#6.  Написати програму калькулятор, яка складається з наступних функцій:
#головної, яка пропонує вибрати дію та додаткових,
# які реалізовують вибрані дії, калькулятор працює доти,
# поки ми не виберемо дію вийти з калькулятора, після виходу,
# користувач отримує повідомлення з подякою за вибір нашого програмного продукту!!!

# def main_func(inp_1_num, inp_2_num):
#     inp_choose = input("Виберіть дії для ваших чисел (+, -, *, /) або вийти з програми (end): ")
#     while inp_choose !='end':
#         if inp_choose == "+":
#             print("Сума чисел = {}".format(inp_1_num+inp_2_num))
#             inp_choose = input("Виберіть дії для ваших чисел (+, -, *, /) або вийти з програми (end): ")
#         elif inp_choose == "-":
#             print("Різниця чисел = {}".format(inp_1_num - inp_2_num))
#             inp_choose = input("Виберіть дії для ваших чисел (+, -, *, /) або вийти з програми (end): ")
#         elif inp_choose == "*":
#             print("Добуток чисел = {}".format(inp_1_num * inp_2_num))
#             inp_choose = input("Виберіть дії для ваших чисел (+, -, *, /) або вийти з програми (end): ")
#         elif inp_choose == "/":
#             print("Частка чисел = {}".format(inp_1_num / inp_2_num))
#             inp_choose = input("Виберіть дії для ваших чисел (+, -, *, /) або вийти з програми (end): ")
#         else:
#             print("Error, Прочитайе умову ще раз!")
#             inp_choose = input("Виберіть дії для ваших чисел (+, -, *, /) або вийти з програми (end): ")
#     print("Дякоємо за вибір нашого програмного продукту!!!")
# print(main_func(int(input("Введіть перше число: ")), int(input("Введіть друге число: "))))

#7.  Побудувати рекурсивну функцію
# обчислення чисел Фібоначі до числа введеного користувачем.
# inp=int(input("Введіть число: "))
# a=1
# b=1
# def fib():
#     global a, b
#     while a < inp:
#         print(a)
#         a=a+b
#         print(b)
#         b=b+a
#         fib()
# print(fib())

